[
  {
    "path": "posts/2021-07-24-dataviz-makeover-3/",
    "title": "DataViz Makeover 3",
    "description": "A makeover of the original visualization to overcome the flaws and showcase a more clear and truthful presentation of data using Tableau.",
    "author": [
      {
        "name": "Vertika Poddar",
        "url": {}
      }
    ],
    "date": "2021-07-24",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Background\r\n2. Critiques and suggestions for the original visualization\r\n2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Alternate Graphical Presentation\r\n3.1 Proposed Design\r\n3.2 Advantages of the design\r\n\r\n4. Proposed Visualization\r\n5. Data Visualization Steps\r\n5.1 Data Preparation\r\n5.2 Data Visualization\r\n5.3. Designing the Dashboard\r\n\r\n6. Key Observations\r\n7. References\r\n\r\n1. Background\r\nThe original visualization is created from the data provided by the DKI Jakarta Provincial Government. The data is available under the sub-section of Open Data Covid-19 DKI Jakarta Province.\r\n\r\nContext\r\nTo support the news write-up of the latest development in DKI Jakarta with respect to Covid - 19 through two visual graphics.\r\n2. Critiques and suggestions for the original visualization\r\n2.1 Clarity\r\nS/N\r\nCritiques\r\nComments / Suggestions\r\n1.\r\nType of graph not appropriate – The two charts are attempting to visualize uncertainty, dot plots and bar charts and not best graphs for such representations.\r\nTwo most commonly used approaches to visualize uncertainty are error bars and confidence bands.\r\n2.\r\nMissing information on Confidence Interval and Margin of Error – The graphs is trying to convey data using the statistical approach. However, no information on the level of confidence interval and margin of error is mentioned anywhere in the graph.\r\nThe graphs should give a complete picture of the data being represented.\r\n3.\r\nLosing a lot of information from the data – The dataset contains a lot of data points pertaining to Covid up-to a sub-district level, but such information is not highlighted in the present graphs.\r\nThe graphical representation should give a clear and truthful presentation of data.\r\n4.\r\nGraph title not in sync with the chart – The tittle of the first graph is “Top five districts with the highest number…”, but the visualization captures the data of all the districts of DKI Jakarta.\r\nThe graph must have a proper title which sets the true context of the visualization.\r\n5.\r\nSource of the data not mentioned\r\nThe graph should state the source of the data for authenticity and clarity.\r\n2.2 Aesthetics\r\nS/N\r\nCritiques\r\nComments / Suggestions\r\nImage\r\n1.\r\nAnnotations overlap data points – The placement of the text annotation used to identify top 5 districts is done in such a way that it overlaps the data points, which makes it difficult to interpret the graph.\r\nAnnotations if used in graphs should be properly aligned to avoid overlapping.\r\n\r\n2.\r\nY Axis labels of the first graph are not legible – All the districts has been mapped in this graph, but the orientation and the size makes it difficult to read and use the visualization.\r\nThe size of the labels and its placement should enhance the usability of the graph.\r\n\r\n3.\r\nY Axis title of the first graph is incomplete\r\nAxis titles should be appropriately aligned and placed at the centre of the axis. This creates visibility and eliminates any ambiguity in interpretation.\r\n\r\n4.\r\nNo tick marks in the X Axis – There are no tick marks in-spite of representing continuous data in both the visuals.\r\nIn case of continuous data, tick marks makes the graph easy and quick to comprehend.\r\n\r\n3. Alternate Graphical Presentation\r\n3.1 Proposed Design\r\nThe rough draft of proposed graphical presentation of the dataset is given below:\r\n\r\n3.2 Advantages of the design\r\nS/N\r\nAspect\r\nIssue\r\nAction Taken\r\n1.\r\nClarity\r\nChoice of graph\r\nError plots used to visualize uncertainty\r\n2.\r\nClarity\r\nMissing information on Confidence Interval and Margin of Error\r\nTooltips appropriately mention the information for better interpretation\r\n3.\r\nClarity\r\nLosing a lot of information from the data\r\nThe two visualizations are interactive which gives information on all the status given in the dataset\r\n4.\r\nClarity\r\nGraph title not in sync with the chart\r\nAppropriately modified\r\n5.\r\nClarity\r\nSource of the data not mentioned\r\nSource mentioned and data link provided\r\n6.\r\nAesthetic\r\nAnnotations overlap data points\r\nNo issue in the revised visuals\r\n7.\r\nAesthetic\r\nY Axis labels of the first graph are not legible\r\nSize adjusted accordingly to increase visibility\r\n8.\r\nAesthetic\r\nY Axis title of the first graph is incomplete\r\nModified and resolved in the new visual\r\n9.\r\nAesthetic\r\nNo tick marks in X Axis\r\nTick marks included in for better interpretation of the data\r\n4. Proposed Visualization\r\nThe remake of the given visualization can be accessed here\r\n5. Data Visualization Steps\r\n5.1 Data Preparation\r\nTableau Prep Builder 2021.1.3 has been used to prepare the data for the purpose of visualization.\r\nOpen the Tableau Prep Builder software and click on ‘Add Connections’ icon on the left hand side of the screen.\r\n\r\nFrom the options under ‘To a File’ select ‘Microsoft Excel’.\r\n\r\nNavigate to the folder path where the base data downloaded from the ‘Open Data Covid-19 Provinsi DKI Jakarta’ website has been stored. Open the file.\r\nClick on the ‘Use Data Interpreter’ option\r\nUse the file named ‘data’, add a clean step to it\r\n\r\nClean the dataset to remove all the irrelevant columns. Remove all the columns except the following: ‘Nama_provinsi’, ‘nama_kota’, ‘nama_kecamatan’, ‘nama_kelurahan’, ‘POSITIF’, ‘Dirawat’, ‘Sembuh’, ‘Meninggal’, ‘Self Isolation’\r\nTo remove the ‘null’ data, right click and click ‘exclude’.\r\n\r\nThe name of the columns of the dataset is in Indonesian, google them to find and replace with the corresponding English names. (Refer the below table)\r\nIndonesian\r\nEnglish\r\nNama_provinsi\r\nProvince\r\nnama_kota\r\nCity\r\nnama_kecamatan\r\nDistrict\r\nnama_kelurahan\r\nSub-district\r\nPOSITIF\r\nPositive\r\nDirawat\r\nTreated\r\nSembuh\r\nRecovered\r\nMeninggal\r\nDeath\r\nSave the output and name the file as ‘Indonesia_Covid Data’\r\n\r\nUse Tableau Desktop, drag and drop the above file on Tableau Desktop to establish a connection and start with data visualization.\r\n5.2 Data Visualization\r\nCreate a parameter - ‘Status’. For this, right click on the Data Pane to select ‘Create Parameter’.\r\n\r\nCreate the parameter ‘Status’. To show the parameter, right click on ‘Status’, select ‘Show Parameter’, the parameter will now appear on the right hand side of the screen.\r\n\r\nUse the ‘Create Calculated Field’ option under the ‘Analysis’ tab.\r\n\r\nCreate a calculated field -Number of records\r\n\r\nCreate a calculated field - Status\r\n\r\nCreate a calculated field - Standard Error\r\n\r\nCreate z scores for 95% and 99% confidence interval\r\n\r\nCreate CI 95% and CI 99%\r\n\r\nLower and Upper CI 95%\r\n\r\nLower and Upper CI 99%\r\n\r\nDrag and drop ‘City’ to Rows and to Filters pane. Select only the following cities from the filter.\r\n\r\nDrag and drop ‘Measure Values’ to Columns. From ‘Measure Values’ keep only Upper and Lower 99% and 95% and drop the rest. Further, rearrange the four metrics as shown in the figure below and change the chart type to ‘Line’.\r\n\r\nDrag and drop ‘Measure Names’ to Path and to Color.\r\n\r\nAssign one color type to the 99%s and another color type to 95%s. Also, use the ‘Color’ pane to modify the lines and add markers.\r\n\r\nDrag and drop ‘Status’ to Columns and change it to average.\r\n\r\nRight click on the x-axis of new populated graph and select ‘Dual Axis’ followed by ‘Synchnorize Axis’ option.\r\nChange the chart type to ‘Circle’ and to increase the size of the circle modify the circle size using the ‘Size’ panel.\r\n\r\nRight click on the ‘Avg Status’ axis and unselect the ‘Show Header’ option.\r\n\r\nNext change the Y Axis title.\r\n\r\nSort ‘City’ as shown in the figure\r\n\r\nEdit the Measure Value tooltip as shown\r\n\r\nEdit the Status tooltip as shown\r\n\r\nTo remove grid lines, right click on the screen and select format. Select lines option as shown in the figure.\r\n\r\nAdjust Tick marks for Y axis as shown below\r\n\r\nTo remove decimals, right click on Measure Value, select Format and do the formatting as below\r\n\r\nTo create an error plot for the Districts, first calculate the following fields.\r\nProportion\r\n\r\nStandard Error for proportion\r\n\r\nLower and Upper limit 95% (in terms of % and value)\r\n\r\nLower and Upper limit 99% (in terms of % and value) (4)\r\n\r\nRankings\r\n\r\nCreate a graph for Districts in similar lines discussed for City above, the snapshot of the error plot will is attached below:\r\n\r\nAdd title to both the charts created.\r\n5.3. Designing the Dashboard\r\nUse the Dashboard tab, drag the two sheets – ‘City’ and ‘District’ to the dashboard space.\r\nUse ‘Text’ under ‘Objects’ to give appropriate title, add source, author and notes relevant to the graphs.\r\nNow the ‘City’ chart has to be linked to the ‘District’ graph in such a way, that upon selecting the plot of the city, the district graphs only display the error plots of selected city only. For this click on the city graph and select the filter icon that gets displayed on the upper right hand corner of the chart.\r\nNext under the ‘Dashboard’ tab select ‘Actions’. Then edit the filter options as shown in the screenshot below:\r\n\r\nThe Dashboard is ready for analysis!\r\n6. Key Observations\r\nJakarta Utara and Jakarta Timur have highest number of average positive and average recovered cases, where as Jakarta Selatan has better average recovery as compared to Jakarta Barat even though the average positive cases of the later is more.\r\n\r\nWhen comparing deaths Jakarta Timur supersedes all the other cities.\r\n\r\nThe district of Cengkareng has both the hightest number of death and treated cases of Covid - 19, while the next four districts are distinct in both the cases.\r\n\r\n7. References\r\nVisualizing uncertainty\r\nISSS608: Visual Analytics – Lesson 4\r\nCreate Parameters\r\nUnderstanding the willingness of public for COVID - 19 vaccination based on survey data\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-25T19:14:27+08:00",
    "input_file": "dataviz-makeover-3.utf8.md"
  },
  {
    "path": "posts/2021-06-13-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "A makeover of the original visualization to overcome the flaws and showcase a more clear and truthful presentation of data using Tableau.",
    "author": [
      {
        "name": "Vertika Poddar",
        "url": {}
      }
    ],
    "date": "2021-06-13",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Background\r\n2. Critiques and suggestions for the original visualization\r\n2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Alternate Graphical Presentation\r\n3.1 Proposed Design\r\n3.2 Advantages of the design\r\n\r\n4. Proposed Visualization\r\n5. Data Visualization Steps\r\n5.1 Data Preparation\r\n5.2 Data Visualization\r\n5.3. Designing the Dashboard\r\n\r\n6. Key Observations\r\n7. References\r\n\r\n1. Background\r\nThe original visualization is created from the data provided by the Department of Statistics, Singapore (DOS). The data is available under the sub-section of Merchandise Trade by Region / Market.\r\n\r\nContext\r\nTo show the data of Singapore’s international trade for a period of ten years from 2011-2020 by using graphical design principles and interactive techniques.\r\n2. Critiques and suggestions for the original visualization\r\n2.1 Clarity\r\nS/N\r\nCritiques\r\nComments / Suggestions\r\n1.\r\nGraph Title is missing – There is no title given to the visualization. A graphical representation is always regarded as incomplete in the absence of a well worded title.\r\nThe graph must have a proper title which sets the true context of the visualization.\r\n2.\r\nTimeline is not indicated – There is no information available in the graph which indicates the period for which this representation is designed.\r\nTime period is one of the key metrics which must find its mention in the graph. In the absence of which the entire intent and message of the graph becoming meaningless as the reader is unable to connect with the data.\r\n3.\r\nBasis of selection of trading partners is not mentioned – The graph depicts the details of ten trading partners, but the basis of selecting these partners finds no mention in the graph or the attached comments.\r\nIn order to provide a complete and a clear picture to the reader, all the assumptions and basis should be mentioned in the visualization.\r\n4.\r\nTerms are confusing – Some specific terms such as ‘Net Importers’ and ‘Net Exporters’ have been used in the visualization, although these have been defined in the graph, the choice of words create a confusion in the reader’s mind.\r\nThe terms used should be clear and avoid any scope of confusion or misunderstanding.\r\n5.\r\nData labels lack information – Data labels have been used to identify bubbles in the graph. While they effectively communicate the name of the trading partner but they lack the details associated with the figures. This makes those numbers meaningless. It leaves a room of interpretation as to what key metric those numbers are trying to communicate to the reader.\r\nAll the labels used in the graph must be appropriately tagged and named to avoid any confusion and deliver the intended information.\r\n6.\r\nUnit of measure and currency missing – Neither the unit of measure is clear from the graph nor the currency is indicated.\r\nThe variables used in the graph must always specify the unit of measure and the currency where the value is monetary.\r\n7.\r\nUnable to identify the value of exports and imports – In the absence of any label or tooltip on the data points we are unable to get the exact value of export or import made to the trading partners.\r\nThe data points should be enhanced to either include a label or a tooltip to provide complete information.\r\n8.\r\nNo information on Balance of Trade – The graph provides no information on the balance of trade.\r\nSince the graph talks about international trade, the information on Balance of Trade is a key metric and should form part of the visualization.\r\n9.\r\nInappropriate commentary – There is a comment in the visualization which talks about Singapore’s trade with Mainland China and United States for the year 2009 and 2006 respectively. Without any context or background or reference for this specific mention, this comment seems inappropriate and the intent of communication is lost.\r\nThe comment in the graph can be a takeaway or a conclusion with some reference to the background. It should be associated with the chart and there should be a direct link with the text and the contents of the charts.\r\n2.2 Aesthetics\r\nS/N\r\nCritiques\r\nComments / Suggestions\r\n1.\r\nSize of the bubbles - The size of the circles used to represent the trading partners is too large. As a result, most of the data points are overlapping, like in the case of Malaysia, EU, Republic of Korea. Further, in some of the cases, the centre point of the bubble (white circle) which gives information on ‘Net Importer’ and ‘Net Exporter’ is also not visible.\r\nIn a Bubble Chart the size of the circles should be appropriate so that data points (bubbles) do not completely overlap.\r\n2.\r\nChoice of colors – The trading partners have been colour coded in the graph, this is a “ChartJunk” as the use of different colours is merely a distraction and does not give any additional information. Moreover, same shade of color has been used to represent EU and Thailand. This creates a misconception that the two trading partners are related, whereas it is not so.\r\nColors in graphs should not be an element of design only, but more importantly they should be capable of communicating some additional insight about the dataset. Cases where they fail to achieve the goal of communication they render the charts as junks.\r\n3.\r\nNo tick marks in both X and Y Axis - Even though both X and Y axis are represented by variables which are continuous in nature, tick marks have not been used in the graph.\r\nWhere the variables are continuous in nature, tick marks are necessary and make the graph easy and quick to comprehend.\r\n4.\r\nInappropriate placement of Axis Title – Both the X and Y axis title is inappropriately placed towards the end.\r\nAxis titles should be appropriately aligned and placed at the centre of the axis. This creates visibility and eliminates any ambiguity in interpretation.\r\n3. Alternate Graphical Presentation\r\n3.1 Proposed Design\r\nThe rough draft of proposed graphical presentation of the dataset is given below:\r\n\r\n3.2 Advantages of the design\r\nS/N\r\nAspect\r\nIssue\r\nAction Taken\r\n1.\r\nClarity\r\nGraph Title is missing\r\nAppropriate Title – “Decoding the Decade of International Trade (2011 – 2020) assigned to the graph.\r\n2.\r\nClarity\r\nTimeline is not indicated\r\nThe graph title provided addresses this issue.\r\n3.\r\nClarity\r\nBasis of selection of trading partners is not mentioned\r\nRanks assigned to the trading partner on the basis of the volume of ‘Total Trade’.\r\n4.\r\nClarity\r\nTerms are confusing\r\nTerms are simplified and their definition is also provided.\r\n5.\r\nClarity\r\nData labels lack information\r\nTooltips are accordingly modified to include complete information.\r\n6.\r\nClarity\r\nUnit of measure and currency missing\r\nAxis Title now includes both currency and the corresponding unit of measure.\r\n7.\r\nClarity\r\nUnable to identify the value of exports and imports\r\nOn hovering over the bubbles the tooltips provide the details also on clicking the bubbles reference line is generated which gives the exact data on these measures.\r\n8.\r\nClarity\r\nNo information on Balance of Trade\r\nThe dashboard has separate graphs to study the trend of Balance of Trade and also to make comparison with other trading partners.\r\n9.\r\nClarity\r\nInappropriate commentary\r\nData which is irrelevant and has no context is removed from the dashboard.\r\n10.\r\nAesthetic\r\nSize of the bubbles\r\nThe size of the bubbles is appropriately adjusted to avoid overlapping and provide a clear visualization.\r\n11.\r\nAesthetic\r\nChoice of colours\r\nThe bubble chart is designed using two color tones. Blue represents excess of Exports over Imports and Red represents excess of Imports over Exports\r\n12.\r\nAesthetic\r\nNo tick marks in both X and Y Axis\r\nTick marks included where axis represents continuous variables for better interpretation of the data\r\n13.\r\nAesthetic\r\nInappropriate placement of Axis Title\r\nAxis Title has been appropriately aligned and placed in the centre for better clarity.\r\nMoreover, the Bubble chart has been animated and the entire dashboard has been made interactive to enable analysis of data from multiple perspectives.\r\n4. Proposed Visualization\r\nThe remake of the given visualization can be accessed here\r\n5. Data Visualization Steps\r\n5.1 Data Preparation\r\nTableau Prep Builder 2021.1.3 has been used to prepare the data for the purpose of visualization.\r\nOpen the Tableau Prep Builder software and click on ‘Add Connections’ icon on the left hand side of the screen.\r\n\r\nFrom the options under ‘To a File’ select ‘Microsoft Excel’.\r\n\r\nNavigate to the folder path where the base data downloaded from the Singstat website has been stored. Open the file.\r\n\r\nClick on the ‘Use Data Interpreter’ option and rename the sheets T1 and T2 as ‘Imports’ and ‘Exports’ respectively.\r\n\r\nFor cleaning both the files, add a ‘Clean Step’ to each of them.\r\n\r\nUnder the ‘Clean Step’ split the ‘Variables’ using ‘Automatic Split’ and rename the ‘Variables’ as ‘Country’ for both ‘Imports’ and ‘Exports’ file. Keep only this modified column and ‘Remove’ the rest.\r\n\r\nAfter this add ‘Pivot’ option to both the files. Select all the months from ‘Fields’ and drop it to the ‘Pivoted Fields’ panel.\r\n\r\nChange the format of ‘Pivot1 Names’ and ‘Pivot2 Names’ to ‘Date’. Further rename them to ‘Year’ and their corresponding ‘Pivot1 Values’ and ‘Pivot2 Values’ to ‘Import Values’ and ‘Export Values’ respectively.\r\n\r\nJoin the two datasets with ‘Country’ and ‘Year’ as join clauses and ‘full’ as the join type.\r\n\r\nAdd a ‘Clean Step’ again to ‘Merge’ the two columns of ‘Country’ and ‘Year’. To merge the fields simply drag and drop one of them on the other.\r\n\r\nSince the base data is in thousand dollars, create a calculated field. Right click and select ‘Custom calculation’ from ‘Create calculated field’ and multiply both the ‘Import Values’ and the ‘Export Values’ by 1000. Remove the original ‘Import Values’ and ‘Export Values’.\r\n\r\nSave the output and name the file as ‘Singapore International Trade data’\r\n\r\nUse Tableau Desktop, drag and drop the file to ‘Singapore International Trade data’ on Tableau Desktop to establish a connection and start with data visualization.\r\n\r\n5.2 Data Visualization\r\nSince the dataset provides information only on the export and the import values, compute ‘Total Trade’ and ‘Balance of Trade’. For this, use the ‘Create Calculated Field’ option under the ‘Analysis’ tab.\r\n\r\nCreate a field for ‘Total Trade’ by summing up ‘Exports’ and ‘Imports’\r\n\r\nNext, create a field for ‘Balance of Trade’ by subtracting ‘Imports’ from ‘Exports’.\r\n\r\nTo create groups of countries, right click on the ‘Country’ dimension > Create > Groups.\r\n\r\nCreate a group of countries that belong to ‘European Union’\r\n\r\nTo rank the trade partners by the volume of ‘Total Trade’, create another calculated field ‘Rankings’ by using the formula given in the screenshot:\r\n\r\nThe period of analysis is from the year 2011-2020. To filter this out, drag ‘Years’ to the ‘Filter’ section. From the dialogue box that pops up, select ‘Years’ and click on ‘Next’.\r\n\r\nFrom the next window that opens up, select all the years from 2011-2020. Click on Apply > OK.\r\n\r\nNext drag and drop ‘Exports’ and ‘Import’ to Columns and Rows respectively. And ‘Country (group)’ to Details.\r\n\r\nSelect ‘Circles’ under ‘Marks and then move ‘Total Trade’ to ‘Size’, ‘Balance of Trade’ to ‘Color’ and ‘Country (group)’ to ‘Label’. Under ‘Size’ modify the size of the bubbles.\r\n\r\nChange the view from ‘Standard’ to ‘Entire view’\r\n\r\nTo animate the bubble chart, drag and drop ‘Years’ to ‘Pages’ and select ‘Animations’ from the ‘Format’ tab. From the ‘Animations’ pane select ‘On’.\r\n\r\nMake the sheet more dynamic by giving an option to select the display of Top N countries by ‘Total Trade’. To do this use the calculated field ‘Rankings’ and drop it to ‘Filters’ pane. Right click on it and select ‘Country (group)’ under ‘Compute using’ option.\r\n\r\nFrom the dialogue box that opens, select the initial value to ‘10’ under ‘Range of values’.\r\n\r\nRight click on the X Axis for ‘Exports’ and select the option ‘Add Reference Line’.\r\n\r\nSet the options as given in the screenshot below. Repeat the same steps on the Y Axis for ‘Imports’.\r\n\r\nEdit the colours for the ‘Balance of Trade’ to two shade colours as given in the screenshot below. This is done because the current shaded pattern does not convey any additional communication from the graph.\r\n\r\nAdd ‘Exports’ and ‘Imports’ to ‘Tooltip’ and then right click to select ‘Format’. From the ‘Pane’ option select ‘Currency (customs)’. Modify the ‘Display units’ to ‘Billions’, ‘Prefix’ to ‘S$’ to denote Singapore Dollars and ‘Negative values’ as given in the below screenshot. Repeat the steps for ‘Imports’, ‘Total Trade’ and ‘Balance of Trade’.\r\n\r\nCreate additional calculated fields ‘Net Exports’ and ‘Net Imports’ as given below. Format these two fields similar in the step above.\r\n\r\nUse the above fields to modify the ‘Tooltip’ as given in the screenshot:\r\n\r\nModify both the X and Y Axis as given below:\r\n\r\nTo modify the background and to sync it with the animation, right click on the chart area > Annotate > Area.\r\n\r\nEdit the annotation as below. Further format the box, by changing the ‘Shading’ of the box to 0%.\r\n\r\nFurther use ‘Annotate’ to divide the chart area into four quadrants as below: • Top Players – High Export, High Import • Leading Customers - High Export, Low Import • Emerging Players - Low Export, Low Import • Leading Suppliers - Low Export, High Import\r\nHide the title and modify the filters to make the sheet more user friendly and rename the sheet as ‘Bubble Plot’.\r\nA snapshot of the bubble graph is attached below:\r\n\r\nNow go to a new sheet to create a line graph to show the trend of the ‘Balance of Trade’ of the trading partners for the decade.\r\nAs in the case of the ‘Bubble Plot’ use the ‘Year’ and the ‘Rankings’ in the ‘Filters’ pane.\r\nDrag and drop ‘Year’ to Columns and ‘Balance of Trade’ to Rows. Add ‘Country (group) to both ‘Detail’ and ‘Color’ field. Also add the calculated field ‘Net Exports’ and ‘Net Imports’ to ‘Tooltip’. Modify the ‘Tooltip’ as below:\r\n\r\nWork in aesthetics similar to the ‘Bubble Plot’ sheet and rename this sheet as ‘Line Chart’. The graph will look similar to the screenshot below:\r\n\r\nNow go to a new sheet, to create a bar and a line graph showing the trend of ‘Exports’, ‘Imports’, ‘Total Trade’ and ‘Balance of Trade’ over a period of ten years.\r\nCreate a new field to assign negative values to all the imports.\r\n\r\nRefer to the screenshot below, to replicate a bar chart. Exports / Imports have been represented by bars and Balance of Trade by a line graph.\r\n\r\n5.3. Designing the Dashboard\r\nUse the Dashboard tab, drag all the three sheets – ‘Bubble Plot’, ‘Line Chart’ and ‘Bar Chart’ to the dashboard space.\r\nUse ‘Text’ under ‘Objects’ to give appropriate title, add source, author and notes relevant to the graphs.\r\nKeep the ‘Year’, ‘# Top Trading Partners’ and ‘Country’ filters to enhance the useability of the dashboard by making it interactive.\r\nWhile the ‘Year’ and ‘#Top Trading Partners’ filter is only for the Bubble plot, the ‘Country’ filter should work on all the graphs. For this go to the tab ‘Bubble Plot’ and right click on the ‘Country’ filter > Apply to Worksheets > All Using This Data Source.\r\n\r\nNow the ‘Bubble Plot’ has to be linked to the Line and the Bar Graphs in such a way, that upon selecting the bubbles of the countries, the line and bar graphs only display the trends of those selected bubbles only. For this click on the bubble plot and select the filter icon that gets displayed on the upper right hand corner of the chart.\r\nNext under the ‘Dashboard’ tab select ‘Actions’. Then edit the filter options as shown in the screenshot below:\r\n\r\nUse the ‘image’ object to place the flag of Singapore. The Dashboard is ready for analysis!\r\n6. Key Observations\r\nNo major change in the ‘Top 10 Trading Partners’ - The composition of the ‘Top 10 Trading partners’ in terms of the volume of ‘Total Trade’ has mostly remained the same over the period of 10 years. On observing the chart of 2011 and 2020 we see that only India has been replaced by Thailand.\r\n\r\nChange in the volume of Trade Although the major players have somewhat remained constant, the volume of trading activities with them has undergone a significant change.\r\nFrom a level of below average trading activities back in 2011 Taiwan has emerged as a leading supplier in 2020. As a matter of fact, in the year 2020 the highest imports were done from Taiwan. This can also be further supported from the graph below, where the graph of ‘Balance of Trade’ for Taiwan is downward sloping.\r\n\r\nExports to Indonesia has drastically reduced during the period of ten years. There was a peak in the year 2018, but post that it has been on a declining trend.\r\n\r\nChange in the nature of Trade – For some major players, the nature of trading activities has taken a U turn, that is if the Balance of Trade was positive in the early 2011 it has become negative in the recent years and vice versa.\r\nIn 2011, highest exports was done to Malaysia, but now in 2020 the value of imports from that country exceeds exports.\r\n\r\nLikewise in the case of United States, in 2011 Singapore use to Import more that Exports but now for this market, the value of exports exceeds the value of Imports.\r\n\r\n7. References\r\nBest Practices for Effective Dashboards\r\nWhat is a bubble chart?\r\nHans Rosling: The best stats you have even seen\r\nISSS608: Visual Analytics – Lesson 2\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-24T03:29:23+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "Vertika Poddar",
        "url": "Singapore Management University"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Background\r\n2. Critiques and suggestions for the original visualization2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Alternate Graphical Presentation3.1 Proposed Design\r\n3.2 Advantages of the design\r\n\r\n4. Proposed Visualization\r\n5. Data Visualization Steps5.1 Data Preparation\r\n5.2 Data Visualization\r\n\r\n6. Key Observations\r\n7. References\r\n\r\n1. Background\r\nThe original visualization is created from the data provided by the Department of Statistics, Singapore (DOS). Context\r\nTo show the volume of international trade over a period of two years from 2019-2020 for six economies of the world namely - Mainland China, US, Malaysia, Taiwan, Hong Kong and Japan.\r\n2. Critiques and suggestions for the original visualization\r\n2.1 Clarity\r\nS/N\r\nCritiques\r\nComments / Suggestions\r\n1\r\nGraph Title - The title of the graph mentions ‘Top Six Trading Countries, 2019-2020’ whereas in terms of combined value of export and import for a period of two years, Japan should be replaced by Indonesia to justify ‘top six’.\r\nThe title of the graph should not only be clear and concise but more importantly should be correct.\r\n2\r\nUse of different scale – The scale used to plot import and export data, especially in case of Hong Kong is not uniform. Export is in terms of millions and Imports is in terms of thousands.\r\nThis practice leads to gross misinterpretation of the graph and makes the visualization practically redundant.\r\n3\r\nIncorrect axis title – The title of X Axis is ‘Month of Period’ whereas the X Axis label is that of the year. The title of the axis is not in sync with the labels.\r\nAll the titles and the labels of the axis should be in place.\r\n4\r\nData not comparable – A separate graph for each country makes the comparison across countries difficult and in-turn makes the graph less handy and useful.\r\nGraph should be designed keeping the key objective in mind.\r\n5\r\nCurrency of the data is not mentioned\r\nIncomplete information leads to assumptions and multiple interpretations.\r\n6\r\nGraph for Japan is misleading - While the title of X axis for all the countries shows a timeline for two years, in case of Japan it shows only 2020.\r\nThere should be uniformity in the graph, otherwise it may lead to incorrect interpretation and defeat the purpose of visualization.\r\n7\r\nSource of the data not mentioned\r\nThe graph should state the source of the data for authenticity and clarity.\r\n2.2 Aesthetics\r\nS/N\r\nCritiques\r\nComments / Suggestions\r\n1\r\nDifferent fonts – Three different fonts have been used in the graph for the Axis Title, Axis Label and Graph Title.\r\nThe text used in the graph should belong to the same font family. Moreover, the font should not be fancy and should be easy to read and understand.\r\n2\r\nMultiple axis for value – Two separate axis to represent export and import.\r\nThe use of two separate value axis makes the graph complicated, confusing, and clumsy. The graph should be clear and pleasing to the eye.\r\n3\r\nNo tick marks in the X and Y Axis – There are no tick marks in-spite of representing continuous data.\r\nIn case of continuous data, tick marks makes the graph easy and quick to comprehend.\r\n3. Alternate Graphical Presentation\r\n3.1 Proposed Design\r\nThe rough draft of proposed graphical presentation for the dataset is\r\n\r\n3.2 Advantages of the design\r\nS/N\r\nAspect\r\nIssue\r\nAction Taken\r\n1\r\nClarity\r\nGraph Title\r\nModified to ‘Major Players of International Trade’\r\n2\r\nClarity\r\nDifferent Scale in the same graph\r\nUniform scale for both Imports and Exports\r\n3\r\nClarity\r\nTitle of Y Axis\r\nRemoved as the X axis label depicts the timeline\r\n4\r\nClarity\r\nCross-country data comparison is difficult\r\nOne single graph with data of all the countries instead of six separate graphs\r\n5\r\nClarity\r\nCurrency not mentioned\r\nThe title of Y axis to highlight the currency\r\n6\r\nClarity\r\nGraph for Japan is misleading\r\nThe new graph resolves the issue\r\n7\r\nClarity\r\nSource of the data not mentioned\r\nSource mentioned and data link provided\r\n8\r\nAesthetic\r\nDifferent usage of fonts\r\nFormatting done to ensure uniformity\r\n9\r\nAesthetic\r\nDual axis for value\r\nOne axis to represent both import and export values\r\n10\r\nAesthetic\r\nNo tick marks in the X and Y Axis\r\nTick marks included in both the axis for better interpretation of the data\r\n4. Proposed Visualization\r\nThe remake of the given visualization can be accessed here\r\n5. Data Visualization Steps\r\n5.1 Data Preparation\r\nMS Excel has been used to prepare the data for the purpose of visualization. There are three sheets in the Excel Workbook –\r\nContent – Remove as not relevant to our work.\r\nT1 – Contains Import Data, rename to ‘Import Data’\r\nT2 – Contains Export Data, rename to ‘Export Data’. All the steps below has been applied to both ‘Import Data’ and ‘Export Data’ sheets.\r\nAs the time frame is Jan’19 - Dec’20 delete all the other columns of both the Import and Export data.\r\nClean the data further removing redundant rows from the top and bottom.\r\n\r\nAs the visualization is concerned with six countries namely – Hong Kong, Mainland China, Japan, Malaysia, Taiwan and US, filter the dataset accordingly to select and keep only these six countries. Remove the rest of the countries from the base file.\r\n\r\nMake the data presentable by deleting the suffix “(Thousand Dollars)” from the name of the countries. The final dataset looks as:\r\n\r\n5.2 Data Visualization\r\nImport the file is in Tableau.\r\n\r\nTo Pivot the data – select all the columns with the time period (Jan’19 – Dec’20). Right click and select “Pivot”.\r\n\r\nRename the headers – Rename ‘Variables’ to ‘Countries’, ‘Pivot Field Names’ to ‘Period’ and ‘Pivot Field Values’ to ‘Import’/’Export’\r\n\r\nChange Data Type of the ‘Period’ from ‘String’ to ‘Date’\r\n\r\nLink the two datasets – ‘Import Data’ and ‘Export Data’ by using the common fields of ‘Countries’ and ‘Period’\r\n\r\nDrag ‘Countries’ and ‘Period’ to Columns and ‘Measure Value’ to Rows\r\n\r\nExpand ‘Year(Period)’ tab to ‘Month(Period)’ and click on the tab to change the format to ‘Month’\r\n\r\nDrop ‘Measure Names’ to the ‘Color’ side panel to differentiate the Export and the Import values\r\n\r\nThis is how the base graph will look like\r\n\r\nThe title of Y Axis is relevant as the timeline is clearly shown. To remove the title, right click on the Y axis and select ‘Edit Axis’. Delete the title under ‘Axis Titles’\r\n\r\nIn a similar way, edit the title of the X Axis\r\n\r\nGive an appropriate title to the graph, change it to ‘Major Players of International Trade’\r\nChange the title of the legend from ‘Measure Names’ to ‘Type of Trade’\r\n\r\nFormat the title and label of the axis to ensure that there is similar font across.\r\nThe data on both the X and the Y Axis is ‘continuous’ in nature, hence both the axis is modified to incorporate ‘tick marks’ for easy and better interpretation. For this, right click on the axis and select ‘Edit Axis’.\r\n\r\nAdd a reference line (right click on the axis and select ‘Add reference line’) to show the average value trade of the six countries – this will make comparison easy.\r\n\r\nFormat the title with grey background and white text.\r\nMove the worksheet to the dashboard.\r\nUse ‘Text’ under ‘Objects’ to add ‘Source’ and ‘Author’.\r\n6. Key Observations\r\nThe impact of COVID – 19 is clearly evident in countries like Mainland China, Malaysia and United States. From the graph we can see that there is a dip in both exports and imports of these countries.\r\nWhile in five countries value of exports is dominated by the value of imports, or are at par, Hong Kong is a big exception. Hong Kong is primarily into exports. The value of imports made by Hong Kong comprises of around 10% of the value of exports. There is a wide gap (of approximately $5 million) in the exports and imports.\r\nTowards the second half of 2020, exports showed a significant improvement both in China and in US.\r\n7. References\r\nMakeoverMonday\r\nStorytelling with data\r\nData Visualization: Clarity or Aesthetics?\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-22-dataviz-makeover-1/Image/DataClean1.png",
    "last_modified": "2021-06-20T22:25:48+08:00",
    "input_file": {}
  }
]
